In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('ocean-acidification-munida-state-1998-2020.csv')
df.head()

,date,year,site,region,measure,data_value,unit,statistic,dataset
0,1998-01-20,1998,Taiaroa Head (50km offshore),Otago,Salinity,3.426800e+01,NaN,Mean,Munida
1,1998-01-20,1998,Taiaroa Head (50km offshore),Otago,Total alkalinity,2.288700e+03,umol/kg-1,Value,Munida
2,1998-01-20,1998,Taiaroa Head (50km offshore),Otago,Dissolved inorganic carbon,2.084500e+03,umol/kg-1,Value,Munida
3,1998-01-20,1998,Taiaroa Head (50km offshore),Otago,pH,8.094800e+00,NaN,Value,Munida
4,1998-01-20,1998,Taiaroa Head (50km offshore),Otago,Hydrogen ion conc,8.039500e-09,mol/kg-1,Value,Munida

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1088 entries, 0 to 1087
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1088 non-null   object
 1   year        1088 non-null   int64
 2   site        1088 non-null   object
 3   region      1088 non-null   object
 4   measure     1088 non-null   object
 5   data_value  1037 non-null   float64
 6   unit        680 non-null    object
 7   statistic   1088 non-null   object
 8   dataset     1088 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 76.6+ KB

In [4]:
df.nunique()

date          136
year           24
site            1
region          1
measure         8
data_value    849
unit            4
statistic       2
dataset         1
dtype: int64

In [5]:
unique_units = df['unit'].unique()
print(unique_units)

[nan 'umol/kg-1' 'mol/kg-1' 'uatm' 'Degrees Celsius']